In [2]:
import pandas as pd

### Creating a Data Frame

In [3]:
data = {
    'Name': ['Ali', 'Danial', 'Rezvan'],
    'Age': [25, 22, None]
}

df = pd.DataFrame(data)

df

     Name   Age
0     Ali  25.0
1  Danial  22.0
2  Rezvan   NaN

### Reading Data

In [4]:
csv_df = pd.read_csv("students.csv")

xlsx_df = pd.read_excel("students.xlsx")

### Data Inspection

In [5]:
df = pd.read_csv("students.csv")

# df.head()

# df.tail()

# df.describe()

# df.info()

### Difference between Pandas Series and Numpy Arrays.

In [6]:
import numpy as np
import pandas as pd


array = np.array([10, 20, 30])
print(array.mean())

series = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(series.mean())

20.0
20.0

### Indexing and Selection

In [7]:
# print(df['Name'])
# print(df[['Name', 'GPA']])

# print(df.loc[0])

# print(df.iloc[0:, 0:])
df

       Name   GPA
0       ALi  16.5
1    Danial  11.7
2  Mohammad   NaN
3     Javid  13.2
4     Karim  29.5
5    Fateme   NaN
6      Asal  15.6
7      Mina   6.1
8    Rezvan  14.3
9      Omid  18.0

### Data Cleaning

In [8]:
# df.dropna(inplace=True)


# df.rename(columns={'Name': 'Full Name'}, inplace=True)

### Data Manipulation

In [9]:

# data = {
#     'Class': ['A', 'B', 'A', 'B', 'A', 'B'],
#     'Students': [8, 8, 11, 12, 13, 11]
# }

# df = pd.DataFrame(data)


# grouped = df.groupby('Class')

# total_students = grouped['Students'].sum()

# print(total_students)

### Filtering

In [10]:
filtered_data = df[df['GPA'] > 20]
filtered_data

    Name   GPA
4  Karim  29.5

### Sorting

In [11]:
# sorted_data = df.sort_values(by='GPA')[::-1]
# sorted_data

### Creating New Columns

In [12]:
from random import randint
df['NGPA'] = df['GPA'] + 1
df['Age'] = 18
df

       Name   GPA  NGPA  Age
0       ALi  16.5  17.5   18
1    Danial  11.7  12.7   18
2  Mohammad   NaN   NaN   18
3     Javid  13.2  14.2   18
4     Karim  29.5  30.5   18
5    Fateme   NaN   NaN   18
6      Asal  15.6  16.6   18
7      Mina   6.1   7.1   18
8    Rezvan  14.3  15.3   18
9      Omid  18.0  19.0   18

### Applying Functions

In [13]:
# def add_age(x):
#     # task
#     return x + 1

df['Age'] = df['Age'].apply(lambda x: x + 1)
df

       Name   GPA  NGPA  Age
0       ALi  16.5  17.5   19
1    Danial  11.7  12.7   19
2  Mohammad   NaN   NaN   19
3     Javid  13.2  14.2   19
4     Karim  29.5  30.5   19
5    Fateme   NaN   NaN   19
6      Asal  15.6  16.6   19
7      Mina   6.1   7.1   19
8    Rezvan  14.3  15.3   19
9      Omid  18.0  19.0   19

### Grouping

In [14]:
# df.loc[:5, 'Age'] = df.loc[:5, 'Age'].apply(lambda x: x + 1) 
# df


# grouped = df.groupby('Age')


# gpa_mean = grouped['GPA'].mean()

# print(gpa_mean)

### Handling Missing Values

In [15]:
df
df.fillna(value=0, inplace=True)

In [16]:
df

       Name   GPA  NGPA  Age
0       ALi  16.5  17.5   19
1    Danial  11.7  12.7   19
2  Mohammad   0.0   0.0   19
3     Javid  13.2  14.2   19
4     Karim  29.5  30.5   19
5    Fateme   0.0   0.0   19
6      Asal  15.6  16.6   19
7      Mina   6.1   7.1   19
8    Rezvan  14.3  15.3   19
9      Omid  18.0  19.0   19

### Merging

In [17]:
import pandas as pd


gholizade_df = pd.DataFrame({
    'Name': ['Ali', 'Danial', 'Rezvan', 'Moosa'],
    'GPA': [20, 19, 15, 20],
    'Class': ['A', 'B', 'C', 'D']
})

amiri_df = pd.DataFrame({
    'Absence': [2, 0, 5, 0],
    'Food': [True, False, False, False],
    'Class': ['A', 'B', 'C', 'D']
})


merged = pd.merge(gholizade_df, amiri_df)
print(merged)

     Name  GPA Class  Absence   Food
0     Ali   20     A        2   True
1  Danial   19     B        0  False
2  Rezvan   15     C        5  False
3   Moosa   20     D        0  False

### joining

In [33]:

gholizade_df = pd.DataFrame({
    'Name': ['Ali', 'Danial', 'Rezvan', 'Moosa'],
    'GPA': [20, 19, 15, 20],
    }, index=['A', 'B', 'C', 'D'])

amiri_df = pd.DataFrame({
    'Absence': [2, 0, 5, 0],
    'Food': [True, False, False, False],
    }, index=['A', 'B', 'C', 'D'])


joined_df = gholizade_df.join(amiri_df)
# print(joined_df)

### concatinating

In [56]:

gholizade_df = pd.DataFrame({
    'Name': ['Ali', 'Danial', 'Rezvan', 'Moosa'],
    'GPA': [20, 19, 15, 20],
    })

amiri_df = pd.DataFrame({
    'Name': ['Reza', 'Hadi', 'Milad', 'Sana'],
    'GPA': [12, 11, 14, 12],
    })

concatenated = pd.concat([gholizade_df, amiri_df], axis=0, ignore_index=True)
print(concatenated)

     Name  GPA  Absence   Food
0     Ali   20        2   True
1  Danial   19        0  False
2  Rezvan   15        5  False
3   Moosa   20        0  False